In [8]:
import pandas as pd

df = pd.read_csv("City Rating without Row Numbers.csv")
df

  cities  temperature  new temp  temp11  idrees  mel  ibrahim
0     KL           23        32     NaN       3    2        7
1     HK           29        31     NaN       2    9        6
2     SG           40        50     NaN       1    8        5
3     NY            0        34     NaN       4    7        1
4    HLS            5        -2     NaN       5    6        2

In [9]:
df2 = pd.read_csv("City Rating.csv")
df2

   Unnamed: 0 cities  temperature  new temp  temp11  idrees  mel  ibrahim
0           0     KL           23        32     NaN       3    2        7
1           1     HK           29        31     NaN       2    9        6
2           2     SG           40        50     NaN       1    8        5
3           3     NY            0        34     NaN       4    7        1
4           4    HLS            5        -2     NaN       5    6        2

In [10]:
df

  cities  temperature  new temp  temp11  idrees  mel  ibrahim
0     KL           23        32     NaN       3    2        7
1     HK           29        31     NaN       2    9        6
2     SG           40        50     NaN       1    8        5
3     NY            0        34     NaN       4    7        1
4    HLS            5        -2     NaN       5    6        2

In [11]:
df2

   Unnamed: 0 cities  temperature  new temp  temp11  idrees  mel  ibrahim
0           0     KL           23        32     NaN       3    2        7
1           1     HK           29        31     NaN       2    9        6
2           2     SG           40        50     NaN       1    8        5
3           3     NY            0        34     NaN       4    7        1
4           4    HLS            5        -2     NaN       5    6        2

In [12]:
df2.drop('Unnamed: 0', axis=1) # columns, axis = 1

  cities  temperature  new temp  temp11  idrees  mel  ibrahim
0     KL           23        32     NaN       3    2        7
1     HK           29        31     NaN       2    9        6
2     SG           40        50     NaN       1    8        5
3     NY            0        34     NaN       4    7        1
4    HLS            5        -2     NaN       5    6        2